
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	АдаптацияКлиент.ПересчетСтрокиТабличнойЧасти(ЭтотОбъект.Элементы.Товары.ПодчиненныеЭлементы.Товары1.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	АдаптацияКлиент.ПересчетСтрокиТабличнойЧасти(ЭтотОбъект.Элементы.Товары.ПодчиненныеЭлементы.Товары1.ТекущиеДанные);
	
КонецПроцедуры


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
